arzh_loadTest/put_ack_1.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 11.805ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 11.882ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.58ms  537.18us   7.38ms   72.31%
    Req/Sec   104.77    109.87   333.00     81.51%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.55ms
 75.000%    2.88ms
 90.000%    3.20ms
 99.000%    3.86ms
 99.900%    6.53ms
 99.990%    7.39ms
 99.999%    7.39ms
100.000%    7.39ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.270     0.000000            1         1.00
       1.946     0.100000          391         1.11
       2.141     0.200000          783         1.25
       2.299     0.300000         1178         1.43
       2.435     0.400000         1560         1.67
       2.551     0.500000         1950         2.00
       2.619     0.550000         2148         2.22
       2.689     0.600000         2340         2.50
       2.749     0.650000         2535         2.86
       2.813     0.700000         2737         3.33
       2.883     0.750000         2926         4.00
       2.921     0.775000         3025         4.44
       2.965     0.800000         3120         5.00
       3.013     0.825000         3218         5.71
       3.071     0.850000         3316         6.67
       3.133     0.875000         3415         8.00
       3.163     0.887500         3462         8.89
       3.197     0.900000         3511        10.00
       3.223     0.912500         3560        11.43
       3.263     0.925000         3611        13.33
       3.311     0.937500         3657        16.00
       3.345     0.943750         3683        17.78
       3.383     0.950000         3705        20.00
       3.427     0.956250         3731        22.86
       3.451     0.962500         3754        26.67
       3.505     0.968750         3779        32.00
       3.551     0.971875         3791        35.56
       3.565     0.975000         3803        40.00
       3.611     0.978125         3815        45.71
       3.665     0.981250         3827        53.33
       3.739     0.984375         3840        64.00
       3.777     0.985938         3846        71.11
       3.801     0.987500         3852        80.00
       3.843     0.989062         3858        91.43
       3.899     0.990625         3864       106.67
       3.979     0.992188         3870       128.00
       4.007     0.992969         3873       142.22
       4.061     0.993750         3876       160.00
       4.255     0.994531         3879       182.86
       4.459     0.995313         3882       213.33
       5.099     0.996094         3885       256.00
       5.375     0.996484         3887       284.44
       5.435     0.996875         3888       320.00
       6.007     0.997266         3890       365.71
       6.091     0.997656         3891       426.67
       6.223     0.998047         3893       512.00
       6.227     0.998242         3894       568.89
       6.227     0.998437         3894       640.00
       6.323     0.998633         3895       731.43
       6.527     0.998828         3896       853.33
       6.567     0.999023         3897      1024.00
       6.567     0.999121         3897      1137.78
       6.567     0.999219         3897      1280.00
       7.107     0.999316         3898      1462.86
       7.107     0.999414         3898      1706.67
       7.215     0.999512         3899      2048.00
       7.215     0.999561         3899      2275.56
       7.215     0.999609         3899      2560.00
       7.215     0.999658         3899      2925.71
       7.215     0.999707         3899      3413.33
       7.387     0.999756         3900      4096.00
       7.387     1.000000         3900          inf
#[Mean    =        2.577, StdDeviation   =        0.537]
#[Max     =        7.384, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.01s, 524.33KB read
Requests/sec:    200.03
Transfer/sec:     17.47KB