arzh_loadTest/put_ack_2.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 11.864ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 11.804ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.50ms  531.61us   7.43ms   71.15%
    Req/Sec   104.86    110.00   444.00     80.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.46ms
 75.000%    2.82ms
 90.000%    3.15ms
 99.000%    3.84ms
 99.900%    6.12ms
 99.990%    7.43ms
 99.999%    7.43ms
100.000%    7.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.145     0.000000            1         1.00
       1.862     0.100000          390         1.11
       2.063     0.200000          781         1.25
       2.215     0.300000         1175         1.43
       2.343     0.400000         1560         1.67
       2.465     0.500000         1955         2.00
       2.529     0.550000         2149         2.22
       2.589     0.600000         2341         2.50
       2.671     0.650000         2537         2.86
       2.741     0.700000         2731         3.33
       2.821     0.750000         2927         4.00
       2.867     0.775000         3026         4.44
       2.913     0.800000         3123         5.00
       2.961     0.825000         3225         5.71
       3.013     0.850000         3315         6.67
       3.073     0.875000         3414         8.00
       3.109     0.887500         3464         8.89
       3.149     0.900000         3510        10.00
       3.193     0.912500         3561        11.43
       3.225     0.925000         3608        13.33
       3.275     0.937500         3657        16.00
       3.309     0.943750         3681        17.78
       3.335     0.950000         3705        20.00
       3.381     0.956250         3732        22.86
       3.417     0.962500         3754        26.67
       3.485     0.968750         3782        32.00
       3.509     0.971875         3791        35.56
       3.537     0.975000         3803        40.00
       3.597     0.978125         3815        45.71
       3.639     0.981250         3827        53.33
       3.693     0.984375         3841        64.00
       3.727     0.985938         3846        71.11
       3.763     0.987500         3852        80.00
       3.791     0.989062         3858        91.43
       3.857     0.990625         3864       106.67
       3.907     0.992188         3870       128.00
       3.935     0.992969         3873       142.22
       3.975     0.993750         3876       160.00
       3.997     0.994531         3879       182.86
       4.041     0.995313         3882       213.33
       4.103     0.996094         3885       256.00
       4.239     0.996484         3887       284.44
       4.391     0.996875         3888       320.00
       5.435     0.997266         3890       365.71
       5.475     0.997656         3891       426.67
       5.643     0.998047         3893       512.00
       5.971     0.998242         3894       568.89
       5.971     0.998437         3894       640.00
       6.031     0.998633         3895       731.43
       6.123     0.998828         3896       853.33
       6.219     0.999023         3897      1024.00
       6.219     0.999121         3897      1137.78
       6.219     0.999219         3897      1280.00
       6.695     0.999316         3898      1462.86
       6.695     0.999414         3898      1706.67
       6.903     0.999512         3899      2048.00
       6.903     0.999561         3899      2275.56
       6.903     0.999609         3899      2560.00
       6.903     0.999658         3899      2925.71
       6.903     0.999707         3899      3413.33
       7.435     0.999756         3900      4096.00
       7.435     1.000000         3900          inf
#[Mean    =        2.500, StdDeviation   =        0.532]
#[Max     =        7.432, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 524.33KB read
Requests/sec:    200.04
Transfer/sec:     17.48KB