arzh_loadTest/put_consistent.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 8.562ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 8.535ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.45ms    0.86ms   6.48ms   67.36%
    Req/Sec   104.81    110.34   333.00     81.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.43ms
 75.000%    3.02ms
 90.000%    3.60ms
 99.000%    4.44ms
 99.900%    4.93ms
 99.990%    6.48ms
 99.999%    6.48ms
100.000%    6.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.435     0.000000            1         1.00
       1.250     0.100000          390         1.11
       1.716     0.200000          780         1.25
       2.012     0.300000         1173         1.43
       2.235     0.400000         1561         1.67
       2.429     0.500000         1951         2.00
       2.551     0.550000         2148         2.22
       2.663     0.600000         2342         2.50
       2.773     0.650000         2539         2.86
       2.887     0.700000         2733         3.33
       3.021     0.750000         2925         4.00
       3.093     0.775000         3028         4.44
       3.175     0.800000         3120         5.00
       3.269     0.825000         3224         5.71
       3.373     0.850000         3316         6.67
       3.477     0.875000         3413         8.00
       3.547     0.887500         3462         8.89
       3.603     0.900000         3511        10.00
       3.661     0.912500         3560        11.43
       3.717     0.925000         3608        13.33
       3.783     0.937500         3658        16.00
       3.837     0.943750         3681        17.78
       3.893     0.950000         3705        20.00
       3.959     0.956250         3730        22.86
       3.999     0.962500         3754        26.67
       4.115     0.968750         3781        32.00
       4.147     0.971875         3792        35.56
       4.183     0.975000         3803        40.00
       4.223     0.978125         3815        45.71
       4.263     0.981250         3827        53.33
       4.335     0.984375         3840        64.00
       4.371     0.985938         3846        71.11
       4.407     0.987500         3854        80.00
       4.431     0.989062         3859        91.43
       4.455     0.990625         3865       106.67
       4.531     0.992188         3870       128.00
       4.551     0.992969         3873       142.22
       4.571     0.993750         3876       160.00
       4.591     0.994531         3879       182.86
       4.619     0.995313         3882       213.33
       4.659     0.996094         3885       256.00
       4.675     0.996484         3887       284.44
       4.683     0.996875         3888       320.00
       4.699     0.997266         3890       365.71
       4.735     0.997656         3891       426.67
       4.771     0.998047         3893       512.00
       4.827     0.998242         3894       568.89
       4.827     0.998437         3894       640.00
       4.903     0.998633         3895       731.43
       4.927     0.998828         3896       853.33
       4.943     0.999023         3897      1024.00
       4.943     0.999121         3897      1137.78
       4.943     0.999219         3897      1280.00
       5.103     0.999316         3898      1462.86
       5.103     0.999414         3898      1706.67
       5.747     0.999512         3899      2048.00
       5.747     0.999561         3899      2275.56
       5.747     0.999609         3899      2560.00
       5.747     0.999658         3899      2925.71
       5.747     0.999707         3899      3413.33
       6.479     0.999756         3900      4096.00
       6.479     1.000000         3900          inf
#[Mean    =        2.451, StdDeviation   =        0.862]
#[Max     =        6.476, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 468.91KB read
Requests/sec:    200.04
Transfer/sec:     15.63KB